mtest> mtreset 590
Resetting memMgr...(592)

mtest> mtnew 3
Calling alloc...(84)
Calling MemMgr::getMem...(84)
Memory acquired... 0x559a82bf0a20
Calling alloc...(84)
Calling MemMgr::getMem...(84)
Memory acquired... 0x559a82bf0a78
Calling alloc...(84)
Calling MemMgr::getMem...(84)
Memory acquired... 0x559a82bf0ad0

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 1
* Free mem in last block: 328
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3
Calling free...(0x559a82bf0ad0)
Calling free...(0x559a82bf0a78)

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 1
* Free mem in last block: 328
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---


mtest> mtnew 5 -a 3
Calling allocArr...(260)
Calling MemMgr::getMem...(260)
Memory acquired... 0x559a82bf0b28
Calling allocArr...(260)
Calling MemMgr::getMem...(260)
New MemBlock... 0x559a82c08330
Memory acquired... 0x559a82bf0eb0
Calling allocArr...(260)
Calling MemMgr::getMem...(260)
Memory acquired... 0x559a82bf0fb8
Calling allocArr...(260)
Calling MemMgr::getMem...(260)
New MemBlock... 0x559a82bf1110
Memory acquired... 0x559a82bf1140
Calling allocArr...(260)
Calling MemMgr::getMem...(260)
Memory acquired... 0x559a82bf1248

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 3
* Free mem in last block: 64
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
ooooo

mtest> mtdel -r 2 -a
Calling freeArr...(0x559a82bf1140)
>> Array size = 3
Recycling 0x559a82bf1140 to _recycleList[3]
Calling freeArr...(0x559a82bf1248)
>> Array size = 3
Recycling 0x559a82bf1248 to _recycleList[3]

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 3
* Free mem in last block: 64
* Recycle list          : 
[  0] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxx

mtest> mtnew -a 2 3
Calling allocArr...(176)
Calling MemMgr::getMem...(176)
New MemBlock... 0x559a82bf13a0
Memory acquired... 0x559a82bf15e0
Calling allocArr...(176)
Calling MemMgr::getMem...(176)
Memory acquired... 0x559a82bf1690
Calling allocArr...(176)
Calling MemMgr::getMem...(176)
Memory acquired... 0x559a82bf1740

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 4
* Free mem in last block: 64
* Recycle list          : 
[  0] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxooo

mtest> mtnew -a 5 3
Calling allocArr...(428)
Calling MemMgr::getMem...(428)
New MemBlock... 0x559a82bf1840
Memory acquired... 0x559a82bf1870
Calling allocArr...(428)
Calling MemMgr::getMem...(428)
Recycling 0x559a82bf1a20 to _recycleList[1]
New MemBlock... 0x559a82bf1ad0
Memory acquired... 0x559a82bf1b00
Calling allocArr...(428)
Calling MemMgr::getMem...(428)
Recycling 0x559a82bf1cb0 to _recycleList[1]
New MemBlock... 0x559a82bf1d60
Memory acquired... 0x559a82bf1d90

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooo

mtest> mtnew -a 7 2
Calling allocArr...(596)
Calling MemMgr::getMem...(596)
Requested memory (600) is greater than block size(592). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooo

mtest> mtdel -r 8 -a
Calling freeArr...(0x559a82bf0fb8)
>> Array size = 3
Recycling 0x559a82bf0fb8 to _recycleList[3]
Calling freeArr...(0x559a82bf1870)
>> Array size = 5
Recycling 0x559a82bf1870 to _recycleList[5]
Calling freeArr...(0x559a82bf1690)
>> Array size = 2
Recycling 0x559a82bf1690 to _recycleList[2]
Calling freeArr...(0x559a82bf15e0)
>> Array size = 2
Recycling 0x559a82bf15e0 to _recycleList[2]

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 2         [  3] = 3         
[  5] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
ooxxxxxoxoo

mtest> mtdel -r 9 -a
Calling freeArr...(0x559a82bf1d90)
>> Array size = 5
Recycling 0x559a82bf1d90 to _recycleList[5]
Calling freeArr...(0x559a82bf1740)
>> Array size = 2
Recycling 0x559a82bf1740 to _recycleList[2]
Calling freeArr...(0x559a82bf0eb0)
>> Array size = 3
Recycling 0x559a82bf0eb0 to _recycleList[3]
Calling freeArr...(0x559a82bf0b28)
>> Array size = 3
Recycling 0x559a82bf0b28 to _recycleList[3]

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 3         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> mtdel -i 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 3         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> mtdel -i 12 -a
Size of array list (11) is <= 12!!
Error: Illegal option!! (12)

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 592 Bytes
* Number of blocks      : 7
* Free mem in last block: 160
* Recycle list          : 
[  0] = 2         [  1] = 2         [  2] = 3         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> q -f

